# coding=utf-8
# import re
import smtplib
from email.mime.text import MIMEText
# s = "__cfduid=d37e152c0821eef6aa9c6ca09660e65371561884765; _ga=GA1.2.1520970134.1561884767; bad_id572d9ba0-d737-11e8-970c-a553533099d1=6f046141-9b14-11e9-93cc-9b702389a8cb; aliyungf_tc=AQAAAMugmRaZ5wcARrLKfGHBcD1tppTi; qimo_seosource_572d9ba0-d737-11e8-970c-a553533099d1=%E7%AB%99%E5%86%85; qimo_seokeywords_572d9ba0-d737-11e8-970c-a553533099d1=; href=https%3A%2F%2Fwww.igxe.cn%2Fcsgo%2F730%3Fis_buying%3D0%26price_from%3D10%26price_to%3D500%26page_no%3D1%26page_size%3D200%26_t%3D1562039824177; accessId=572d9ba0-d737-11e8-970c-a553533099d1; nice_id572d9ba0-d737-11e8-970c-a553533099d1=247b5552-9e22-11e9-9bb0-4fc256ce68de; Hm_lvt_fe0238ac0617c14d9763a2776288b64b=1561991438,1562037420,1562074729,1562220508; _gid=GA1.2.1846847049.1562220508; _9755xjdesxxd_=32; gdxidpyhxdE=peHiCdPfZhyv8PLXSWU3Ak5%5CRrIPe4Xc7eEW%2ByEd64pbK5UcjIK23tmNG3eNcNAXK7CBBi8HbpY4qPu5%5C4M9zV%5CVlTVCP7H0%2BsK1cs669KcIi5oIVnpHIvkRsn1hr7lyq8OYUJxvIjtLq%2BkbfCzcOv8DWZeWgo6ZUOlNpqBpCDUn%2FcSW%3A1562223747160; csrftoken=kSIGH1tQFUChsZIhleeVDBDPgztWjKpf; token=af95c34c-1647-483a-ab0c-58efad65ef10; sessionid=5l7mcsx1xmm5stqqycdopryepxxvj3nx; Hm_lpvt_fe0238ac0617c14d9763a2776288b64b=1562224472; pageViewNum=13; myDateMinutes=18"
# l = s.split(";")
# cookies = {}
# for i in l:
#     i_list = i.split("=")
#     cookies[i_list[0]] = i_list[1]
#
# a = [1,2,3,5]
# b = [1,2,3,4]
# print(list(set(b).difference(set(a))))
s = ["[['商品', '件数', '正在销售价格', '求购', '差价', '历史时间', '历史价格'], ['音乐盒（StatTrak™） | Neck Deep — 人生何处不青山', 87, 79.1, 71.5, 7.599999999999994, '2019年07月05日', '79.20'], ['音乐盒（StatTrak™） | Neck Deep — 人生何处不青山', 87, 79.3, 71.5, 7.799999999999997, '2019年07月05日', '79.30'], ['音乐盒（StatTrak™） | Neck Deep — 人生何处不青山', 87, 79.3, 71.5, 7.799999999999997, '2019年07月05日', '79.00'], ['音乐盒（StatTrak™） | Neck Deep — 人生何处不青山', 87, 79.4, 71.5, 7.900000000000006, '2019年07月05日', '79.00'], ['音乐盒（StatTrak™） | Neck Deep — 人生何处不青山', 87, 79.4, 71.5, 7.900000000000006, '2019年07月05日', '79.00'], ['音乐盒（StatTrak™） | Neck Deep — 人生何处不青山', 87, 79.4, 71.5, 7.900000000000006, '2019年07月05日', '79.09'], ['音乐盒（StatTrak™） | Neck Deep — 人生何处不青山', 87, 79.4, 71.5, 7.900000000000006, '2019年07月05日', '79.10'], ['音乐盒（StatTrak™） | Neck Deep — 人生何处不青山', 87, 79.9, 71.5, 8.400000000000006, '2019年07月05日', '79.30'], ['音乐盒（StatTrak™） | Neck Deep — 人生何处不青山', 87, 80.0, 71.5, 8.5, '2019年07月05日', '71.00'], ['音乐盒（StatTrak™） | Neck Deep — 人生何处不青山', 87, 80.0, 71.5, 8.5, '2019年07月05日', '79.00']]", "[['商品', '件数', '正在销售价格', '求购', '差价', '历史时间', '历史价格'], ['CZ75 自动手枪（StatTrak™） | 红鹰 (略有磨损)', 27, 18.4, 11.0, 7.399999999999999, '2019年07月05日', '18.50'], ['CZ75 自动手枪（StatTrak™） | 红鹰 (略有磨损)', 27, 18.5, 11.0, 7.5, '2019年07月03日', '18.00'], ['CZ75 自动手枪（StatTrak™） | 红鹰 (略有磨损)', 27, 18.5, 11.0, 7.5, '2019年07月03日', '15.00'], ['CZ75 自动手枪（StatTrak™） | 红鹰 (略有磨损)', 27, 19.7, 11.0, 8.7, '2019年07月02日', '20.00'], ['CZ75 自动手枪（StatTrak™） | 红鹰 (略有磨损)', 27, 19.7, 11.0, 8.7, '2019年07月02日', '20.00'], ['CZ75 自动手枪（StatTrak™） | 红鹰 (略有磨损)', 27, 19.78, 11.0, 8.780000000000001, '2019年07月02日', '18.60'], ['CZ75 自动手枪（StatTrak™） | 红鹰 (略有磨损)', 27, 19.79, 11.0, 8.79, '2019年06月30日', '19.70'], ['CZ75 自动手枪（StatTrak™） | 红鹰 (略有磨损)', 27, 19.79, 11.0, 8.79, '2019年06月29日', '19.00'], ['CZ75 自动手枪（StatTrak™） | 红鹰 (略有磨损)', 27, 19.79, 11.0, 8.79, '2019年06月26日', '19.19'], ['CZ75 自动手枪（StatTrak™） | 红鹰 (略有磨损)', 27, 19.8, 11.0, 8.8, '2019年06月25日', '19.80']]", "[['商品', '件数', '正在销售价格', '求购', '差价', '历史时间', '历史价格'], ['AWP | 树蝰 (略有磨损)', 155, 47.5, 41.1, 6.399999999999999, '2019年07月05日', '47.70'], ['AWP | 树蝰 (略有磨损)', 155, 47.7, 41.1, 6.600000000000001, '2019年07月05日', '47.60'], ['AWP | 树蝰 (略有磨损)', 155, 47.9, 41.1, 6.799999999999997, '2019年07月05日', '44.00'], ['AWP | 树蝰 (略有磨损)', 155, 47.9, 41.1, 6.799999999999997, '2019年07月05日', '47.60'], ['AWP | 树蝰 (略有磨损)', 155, 47.9, 41.1, 6.799999999999997, '2019年07月05日', '44.90'], ['AWP | 树蝰 (略有磨损)', 155, 47.9, 41.1, 6.799999999999997, '2019年07月05日', '47.00'], ['AWP | 树蝰 (略有磨损)', 155, 47.9, 41.1, 6.799999999999997, '2019年07月05日', '50.00'], ['AWP | 树蝰 (略有磨损)', 155, 48.0, 41.1, 6.899999999999999, '2019年07月05日', '47.90'], ['AWP | 树蝰 (略有磨损)', 155, 48.0, 41.1, 6.899999999999999, '2019年07月05日', '47.60'], ['AWP | 树蝰 (略有磨损)', 155, 49.6, 41.1, 8.5, '2019年07月05日', '47.80']]", "[['商品', '件数', '正在销售价格', '求购', '差价', '历史时间', '历史价格'], ['AWP | 树蝰 (略有磨损)', 155, 47.4, 41.1, 6.299999999999997, '2019年07月05日', '47.70'], ['AWP | 树蝰 (略有磨损)', 155, 47.5, 41.1, 6.399999999999999, '2019年07月05日', '47.60'], ['AWP | 树蝰 (略有磨损)', 155, 47.7, 41.1, 6.600000000000001, '2019年07月05日', '44.00'], ['AWP | 树蝰 (略有磨损)', 155, 47.9, 41.1, 6.799999999999997, '2019年07月05日', '47.60'], ['AWP | 树蝰 (略有磨损)', 155, 47.9, 41.1, 6.799999999999997, '2019年07月05日', '44.90'], ['AWP | 树蝰 (略有磨损)', 155, 47.9, 41.1, 6.799999999999997, '2019年07月05日', '47.00'], ['AWP | 树蝰 (略有磨损)', 155, 47.9, 41.1, 6.799999999999997, '2019年07月05日', '50.00'], ['AWP | 树蝰 (略有磨损)', 155, 47.9, 41.1, 6.799999999999997, '2019年07月05日', '47.90'], ['AWP | 树蝰 (略有磨损)', 155, 48.0, 41.1, 6.899999999999999, '2019年07月05日', '47.60'], ['AWP | 树蝰 (略有磨损)', 155, 48.0, 41.1, 6.899999999999999, '2019年07月05日', '47.80']]", "[['商品', '件数', '正在销售价格', '求购', '差价', '历史时间', '历史价格'], ['CZ75 自动手枪（StatTrak™） | 红鹰 (略有磨损)', 28, 18.4, 11.0, 7.399999999999999, '2019年07月05日', '18.50'], ['CZ75 自动手枪（StatTrak™） | 红鹰 (略有磨损)', 28, 18.5, 11.0, 7.5, '2019年07月03日', '18.00'], ['CZ75 自动手枪（StatTrak™） | 红鹰 (略有磨损)', 28, 18.5, 11.0, 7.5, '2019年07月03日', '15.00'], ['CZ75 自动手枪（StatTrak™） | 红鹰 (略有磨损)', 28, 19.7, 11.0, 8.7, '2019年07月02日', '20.00'], ['CZ75 自动手枪（StatTrak™） | 红鹰 (略有磨损)', 28, 19.7, 11.0, 8.7, '2019年07月02日', '20.00'], ['CZ75 自动手枪（StatTrak™） | 红鹰 (略有磨损)', 28, 19.78, 11.0, 8.780000000000001, '2019年07月02日', '18.60'], ['CZ75 自动手枪（StatTrak™） | 红鹰 (略有磨损)', 28, 19.79, 11.0, 8.79, '2019年06月30日', '19.70'], ['CZ75 自动手枪（StatTrak™） | 红鹰 (略有磨损)', 28, 19.79, 11.0, 8.79, '2019年06月29日', '19.00'], ['CZ75 自动手枪（StatTrak™） | 红鹰 (略有磨损)', 28, 19.79, 11.0, 8.79, '2019年06月26日', '19.19'], ['CZ75 自动手枪（StatTrak™） | 红鹰 (略有磨损)', 28, 19.8, 11.0, 8.8, '2019年06月25日', '19.80']]", "[['商品', '件数', '正在销售价格', '求购', '差价', '历史时间', '历史价格'], ['AWP | 树蝰 (略有磨损)', 156, 47.4, 41.1, 6.299999999999997, '2019年07月05日', '47.70'], ['AWP | 树蝰 (略有磨损)', 156, 47.5, 41.1, 6.399999999999999, '2019年07月05日', '47.60'], ['AWP | 树蝰 (略有磨损)', 156, 47.7, 41.1, 6.600000000000001, '2019年07月05日', '44.00'], ['AWP | 树蝰 (略有磨损)', 156, 47.9, 41.1, 6.799999999999997, '2019年07月05日', '47.60'], ['AWP | 树蝰 (略有磨损)', 156, 47.9, 41.1, 6.799999999999997, '2019年07月05日', '44.90'], ['AWP | 树蝰 (略有磨损)', 156, 47.9, 41.1, 6.799999999999997, '2019年07月05日', '47.00'], ['AWP | 树蝰 (略有磨损)', 156, 47.9, 41.1, 6.799999999999997, '2019年07月05日', '50.00'], ['AWP | 树蝰 (略有磨损)', 156, 47.9, 41.1, 6.799999999999997, '2019年07月05日', '47.90'], ['AWP | 树蝰 (略有磨损)', 156, 48.0, 41.1, 6.899999999999999, '2019年07月05日', '47.60'], ['AWP | 树蝰 (略有磨损)', 156, 48.0, 41.1, 6.899999999999999, '2019年07月05日', '47.80']]"]
dd = []
for m in s:
    dd.append(eval(m))
for i in dd:
    for j, item in enumerate(i):
        print(j,item)
def send_mail(res):
    # 将结果发送邮件

    msg_from='1298045658@qq.com'
    passwd='lujdzcveprsyijce'
    msg_to='sunzhangming@itcast.cn'
    content = res
    subject="有新装备可以抢啦"
    msg = MIMEText(content)
    msg['Subject'] = subject
    msg['From'] = msg_from
    msg['To'] = msg_to
    try:
        s = smtplib.SMTP_SSL("smtp.qq.com",465)
        s.login(msg_from, passwd)
        s.sendmail(msg_from, msg_to, msg.as_string())
        print("发送成功")
    except s.SMTPException as e:
        print("发送失败")
    finally:
        s.quit()
send_mail(str(s))